In [1]:
!pip3 install pandas

Requirement already satisfied: pandas in c:\users\itzme\anaconda3\lib\site-packages (2.0.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\itzme\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\itzme\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\itzme\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\itzme\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\itzme\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

# Loading in Data

In [12]:
import pandas as pd
df = pd.read_csv('RegularSeasonCompactResults.csv')

# The Basics

In [13]:
df.head()

   Season  DayNum  WTeamID  WScore  LTeamID  LScore WLoc  NumOT
0    1985      20     1228      81     1328      64    N      0
1    1985      25     1106      77     1354      70    H      0
2    1985      25     1112      63     1223      56    H      0
3    1985      25     1165      70     1432      54    H      0
4    1985      25     1192      86     1447      74    H      0

In [14]:
df.tail()

        Season  DayNum  WTeamID  WScore  LTeamID  LScore WLoc  NumOT
161547    2019     132     1153      69     1222      57    N      0
161548    2019     132     1209      73     1426      64    N      0
161549    2019     132     1277      65     1276      60    N      0
161550    2019     132     1387      55     1382      53    N      0
161551    2019     132     1463      97     1217      85    H      0

In [15]:
df.shape

(161552, 8)

In [16]:
df.columns.tolist()

['Season', 'DayNum', 'WTeamID', 'WScore', 'LTeamID', 'LScore', 'WLoc', 'NumOT']

In [17]:
df.describe()

,Season,DayNum,WTeamID,WScore,LTeamID,LScore,NumOT
count,161552.000000,161552.000000,161552.000000,161552.000000,161552.000000,161552.000000,161552.000000
mean,2003.228731,74.665359,1286.919004,76.795125,1282.637498,64.692526,0.045137
std,10.058660,33.670352,104.521630,12.066260,104.742961,11.349610,0.249751
min,1985.000000,0.000000,1101.000000,34.000000,1101.000000,20.000000,0.000000
25%,1995.000000,47.000000,1198.000000,69.000000,1191.000000,57.000000,0.000000
50%,2004.000000,77.000000,1284.000000,76.000000,1280.000000,64.000000,0.000000
75%,2012.000000,103.000000,1380.000000,84.000000,1375.000000,72.000000,0.000000
max,2019.000000,132.000000,1466.000000,186.000000,1466.000000,150.000000,6.000000

In [18]:
df.max()

Season     2019
DayNum      132
WTeamID    1466
WScore      186
LTeamID    1466
LScore      150
WLoc          N
NumOT         6
dtype: object

In [22]:
df['WScore'].max()

186

In [25]:
df['LScore'].mean()

64.69252624541943

In [28]:
df['WScore'].argmax()

24970

In [29]:
df['Season'].value_counts()

Season
2019    5463
2018    5405
2017    5395
2016    5369
2014    5362
2015    5354
2013    5320
2010    5263
2012    5253
2009    5249
2011    5246
2008    5163
2007    5043
2006    4757
2005    4675
2003    4616
2004    4571
2002    4555
2000    4519
2001    4467
1999    4222
1998    4167
1997    4155
1992    4127
1991    4123
1996    4122
1995    4077
1994    4060
1990    4045
1989    4037
1993    3982
1988    3955
1987    3915
1986    3783
1985    3737
Name: count, dtype: int64

# Acessing Values

In [30]:
df.iloc[[df['WScore'].argmax()]]

       Season  DayNum  WTeamID  WScore  LTeamID  LScore WLoc  NumOT
24970    1991      68     1258     186     1109     140    H      0

In [31]:
df.iloc[[df['WScore'].argmax()]]['LScore']

24970    140
Name: LScore, dtype: int64

In [32]:
type(df.iloc[[df['WScore'].argmax()]]['LScore'])

pandas.core.series.Series

In [33]:
type(df.iloc[[df['WScore'].argmax()]])

pandas.core.frame.DataFrame

In [34]:
df.iloc[[df['WScore'].argmax()]]['LScore'][24970]

140

In [35]:
df.iloc[:3]

   Season  DayNum  WTeamID  WScore  LTeamID  LScore WLoc  NumOT
0    1985      20     1228      81     1328      64    N      0
1    1985      25     1106      77     1354      70    H      0
2    1985      25     1112      63     1223      56    H      0

In [36]:
df.loc[:3]

   Season  DayNum  WTeamID  WScore  LTeamID  LScore WLoc  NumOT
0    1985      20     1228      81     1328      64    N      0
1    1985      25     1106      77     1354      70    H      0
2    1985      25     1112      63     1223      56    H      0
3    1985      25     1165      70     1432      54    H      0

In [38]:
df.loc[df['WScore'].argmax(),'LScore']

140

In [39]:
df.at[df['WScore'].argmax(),'LScore']

140

# Sorting

In [40]:
df.sort_values('LScore').head()

        Season  DayNum  WTeamID  WScore  LTeamID  LScore WLoc  NumOT
100027    2008      66     1203      49     1387      20    H      0
49310     1997      66     1157      61     1204      21    H      0
89021     2006      44     1284      41     1343      21    A      0
85042     2005      66     1131      73     1216      22    H      0
103660    2009      26     1326      59     1359      22    H      0

In [41]:
df.groupby('LScore')

# Filtering Rows Conditionally

In [42]:
df[df['WScore'] > 150]

       Season  DayNum  WTeamID  WScore  LTeamID  LScore WLoc  NumOT
5269     1986      75     1258     151     1109     107    H      0
12046    1988      40     1328     152     1147      84    H      0
12355    1988      52     1328     151     1173      99    N      0
16040    1989      40     1328     152     1331     122    H      0
16853    1989      68     1258     162     1109     144    A      0
17867    1989      92     1258     181     1109     150    H      0
19653    1990      30     1328     173     1109     101    H      0
19971    1990      38     1258     152     1109     137    A      0
20022    1990      40     1116     166     1109     101    H      0
22145    1990      97     1258     157     1362     115    H      0
23582    1991      26     1318     152     1258     123    N      0
24341    1991      47     1328     172     1258     112    H      0
24970    1991      68     1258     186     1109     140    H      0
25656    1991      84     1106     151     1212      97    H      0
28687    1992      54     1261     159     1319      86    H      0
35023    1993     112     1380     155     1341      91    A      0
40060    1995      32     1375     156     1341     114    H      0
52600    1998      33     1395     153     1410      87    H      0

In [44]:
df[(df['WScore'] > 150) & (df['LScore'] < 100)]

       Season  DayNum  WTeamID  WScore  LTeamID  LScore WLoc  NumOT
12046    1988      40     1328     152     1147      84    H      0
12355    1988      52     1328     151     1173      99    N      0
25656    1991      84     1106     151     1212      97    H      0
28687    1992      54     1261     159     1319      86    H      0
35023    1993     112     1380     155     1341      91    A      0
52600    1998      33     1395     153     1410      87    H      0

# Grouping

In [47]:
df.groupby('WTeamID')['WScore'].mean().head()

WTeamID
1101    75.500000
1102    70.675439
1103    75.989492
1104    75.834586
1105    74.788360
Name: WScore, dtype: float64

In [48]:
df.groupby('WTeamID')['WLoc'].value_counts().head(9)

WTeamID  WLoc
1101     H        31
         A        23
         N         8
1102     H       228
         A        79
         N        35
1103     H       359
         A       163
         N        49
Name: count, dtype: int64

In [49]:
df.values

array([[1985, 20, 1228, ..., 64, 'N', 0],
       [1985, 25, 1106, ..., 70, 'H', 0],
       [1985, 25, 1112, ..., 56, 'H', 0],
       ...,
       [2019, 132, 1277, ..., 60, 'N', 0],
       [2019, 132, 1387, ..., 53, 'N', 0],
       [2019, 132, 1463, ..., 85, 'H', 0]], dtype=object)

In [50]:
df.values[0][0]

1985

# Dataframe Iteration

In [51]:
for index, row in df.iterrows():
    print(row)
    if index == 1:
        break

Season     1985
DayNum       20
WTeamID    1228
WScore       81
LTeamID    1328
LScore       64
WLoc          N
NumOT         0
Name: 0, dtype: object
Season     1985
DayNum       25
WTeamID    1106
WScore       77
LTeamID    1354
LScore       70
WLoc          H
NumOT         0
Name: 1, dtype: object

# Extracting Rows and Columns

In [52]:
df[['WScore', 'LScore']].head()

   WScore  LScore
0      81      64
1      77      70
2      63      56
3      70      54
4      86      74

In [53]:
df.loc[:, ['WScore', 'LScore']].head()

   WScore  LScore
0      81      64
1      77      70
2      63      56
3      70      54
4      86      74

In [54]:
type(df['WScore'])

pandas.core.series.Series

In [55]:
type(df[['WScore']])

pandas.core.frame.DataFrame

In [56]:
df[0:3]

   Season  DayNum  WTeamID  WScore  LTeamID  LScore WLoc  NumOT
0    1985      20     1228      81     1328      64    N      0
1    1985      25     1106      77     1354      70    H      0
2    1985      25     1112      63     1223      56    H      0

In [57]:
df.iloc[0:3,:]

   Season  DayNum  WTeamID  WScore  LTeamID  LScore WLoc  NumOT
0    1985      20     1228      81     1328      64    N      0
1    1985      25     1106      77     1354      70    H      0
2    1985      25     1112      63     1223      56    H      0

In [58]:
df.isnull().sum()

Season     0
DayNum     0
WTeamID    0
WScore     0
LTeamID    0
LScore     0
WLoc       0
NumOT      0
dtype: int64